cottenc/FlightsAbove/sdkconfig.defaults
# SenseCAP Indicator D1Pro - ESP32-S3 + 8 MB flash + PSRAM
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# LVGL
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64

# RGB LCD scanout
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# SenseCAP Indicator board + screen variant
CONFIG_FLIGHTSABOVE_PLATFORM_SENSECAP=y
CONFIG_LCD_BOARD_SENSECAP_INDICATOR_D1=y
CONFIG_SENSECAP_INDICATOR_SCREEN_GX=y
CONFIG_LCD_EVB_SCREEN_ROTATION_0=y
CONFIG_LCD_EVB_SCREEN_FREQ=16
CONFIG_LCD_AVOID_TEAR=y
CONFIG_LCD_LVGL_DIRECT_MODE=y
